---
kind: type
id: T:Autodesk.Revit.DB.StructuralAssetClass
source: html/f62eea04-3d37-6450-9d5b-52627d3e677b.htm
---
# Autodesk.Revit.DB.StructuralAssetClass

Represents the type of material described by a structural asset. This enum value is returned by Autodesk::Revit::DB::StructuralAsset::StructuralAssetClass.

## Syntax (C#)
```csharp
public enum StructuralAssetClass
```